---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveDriverError
source: html/3fd184e1-591b-20ec-50bf-177938d7f425.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveDriverError Property

Element's internal join data is corrupt.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveDriverError { get; }
```